---
kind: other
id: Methods.T:Autodesk.Revit.DB.ReferenceArrayArray
source: html/351bc8bb-7b24-55fe-636a-1ca90d009609.htm
---
# ReferenceArrayArray Methods

Removes every ReferenceArray from the array, rendering it empty.